Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer.ChamferEndTypeEnum Enumeration
 The end type of the edge chamfer.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ChamferEndTypeEnum
Public Enumeration ChamferEndTypeEnum
Members
Member name | Value | Description
FULL | 0 |  The chamfer continues to the end of the edge.
STRAIGHT | 1 |  The chamfer end is straight at the given point.
BEVELLED | 2 |  The chamfer end is bevelled at the given point.
See Also
Reference
Tekla.Structures.Model Namespace